{"url":"https://pudding.cool/2023/03/same-name/method","title":"Data and Methods","description":"An interactive explainer for how we made A Map of Places with the Same Name","hed":"Data &amp; Methods","dek":"An interactive explainer for the choices in <br> <a href=../>A Map of Places with the Same Name</a>","placeNote":"<strong># of Counties</strong> is how many times that place is the top ranked place above the <strong>maybe</strong> threshold.","countyNote":"<strong>Share Margin</strong> is the difference between the scores (as percent share) of the top two ranked places.","introExplanation":[{"type":"text","value":"We chose to blend three properties to match our perception of how this plays out in reality:"},{"type":"text","value":"<strong>Distance</strong>: the proximity to a place."},{"type":"text","value":"<strong>Population</strong>: the size of a place is a pretty good indicator of its importance."},{"type":"text","value":"<strong>Wikipedia article length</strong>: an extra layer of nuance for the cultural importance/awareness of places that may not have a large population."}],"valueExplanation":[{"type":"text","value":"There are a few different metrics we computed to see what matched our intuition the best:"},{"type":"text","value":"<strong>score:</strong> the raw numerical score as calculated according to the three properties."},{"type":"text","value":"<strong>share:</strong> the score as a percent of the sum of all place scores for each county."},{"type":"text","value":"<strong>shareDelta:</strong> how much bigger the highest score is than the next highest."},{"type":"text","value":"<strong>Score</strong> on its own looks at things in isolation so that felt too siloed. When then tried <strong>share</strong> because it accounted for the effects of adding more places to the mix and giving each a bit of gravity. We ended up using <strong>shareDelta</strong> because of the small nuance it added. There are often times when two or more place shares are quite high, but since we only pick the top one the others are drowned out. By looking at <em>how much</em> higher the top one is, it better reflects the likelihood of one place over another."},{"type":"text","value":"<strong>Scale relative to counties</strong> basically means to look at that value compared to all results or independently. Say for example The maximum <strong>share</strong> for any county is 40. We would then normalize all county values to that. So a share of 20 would actually mean a value of 50%."},{"type":"text","value":"We chose to weight distance more heavily because we wanted to make it so if you are in or near the place you are referring to, it should always win, regardless of how big an external place is."}],"thresholdExplanation":[{"type":"text","value":"Based on the resulting value from above, which ones get the full opacity (probably) and which get reduced opacity (maybe). The right values here are the most driven by feel, and vary greatly depending on which metrics you select above and if the scores are relative or not."}],"distanceExplanation":[{"type":"text","value":"We chose a logarithmic scale because it felt most accurate: if you are really close to a place its gravity should be felt more heavily than if you get farther away. Anything under the minimum (we chose 50 miles) gets the highest score (1), anything over the maximum (300 miles) gets 0."}],"populationExplanation":[{"type":"text","value":"Like distance, we chose to clamp the maximum value here. At a certain size, there is really little distinction. We chose to use a computed threshold as our max clamp of the top 0.1% percentile. We also chose an exponential scale to curb the effects of the lopsided distribution, so the medium-sized places still have some weight and aren’t lumped with the places with very low numbers."}],"wikiExplanation":[{"type":"text","value":"Like distance, we chose to clamp the maximum value here. At a certain size, there is really little distinction. We chose to use a computed threshold as our max clamp of the top 0.1% percentile. We also chose an exponential scale to curb the effects of the lopsided distribution, so the medium-sized places still have some weight and aren’t lumped with the places with very low numbers."}],"miscExplanation":[{"type":"text","value":"If you want a good example of the results not “working” with our presets, check out Georgia, where we would’ve wanted the state to be the dominant place over the country."},{"type":"text","value":"We conceived of this project thinking about how people talk about places, so  they are grouped together if they share either the same spelling or pronunciation (using phoneme matching)."},{"type":"text","value":"We only used international cities with populations over 100,000 since it is unlikely that smaller ones are well-known to most people in the US."},{"type":"text","value":"Although places can be in multiple counties, we are only displaying the first one in the tables for brevity."},{"type":"text","value":"We used an amalgamation of data sources:"},{"type":"text","value":"<a href=https://www.uscitieslist.org/ target=blank rel=noreferrer>Incorporated US cities</a>"},{"type":"text","value":"<a href=https://en.wikipedia.org/wiki/Category:Unincorporated_communities_in_the_United_States_by_county target=_blank rel=noreferrer>Unincorporated US cities</a>"},{"type":"text","value":"<a href=https://www.census.gov/data-tools/demo/idb/#/table?COUNTRY_YEAR=2023&COUNTRY_YR_ANIM=2023 target=blank rel=noreferrer>Countries</a>"},{"type":"text","value":"<a href=https://simplemaps.com/data/world-cities target=blank rel=noreferrer>International cities</a>"},{"type":"text","value":"<a href=https://www.census.gov/data/tables/time-series/demo/popest/2020s-national-total.html target=blank rel=noreferrer>States</a>"},{"type":"text","value":"We are constantly updating the data, so if you spot something wrong with the places being used (or not), <a href=https://docs.google.com/spreadsheets/d/1cHtvcuxvxI6Y2hA5Xa2wg8AW0SZ7ZYG5H5x7H4jGLdk/edit#gid=0 target=_blank rel=noreferrer>help us improve it!</a>"},{"type":"text","value":"Get in touch at russell@pudding.cool, and consider supporting The Pudding on <a href=https://www.patreon.com/thepudding target=_blank rel=noreferrer>Patreon!</a>"}]}