{"url":"https://pudding.cool/2023/03/same-name","title":"A Map of Places in the US with the Same Name","description":"We took a shot at calculating what place someone is most likely referring to, depending on where they are.","overline":"A Map of Places in the US <br>","hed":"We calculated what place someone is most likely referring to, depending on where they are.","hed2":"This is an attempt to calculate what place someone is most likely referring to, depending on where they are.","dek":"There are thousands of cities and towns in the US that share their name with another place. We took a shot at calculating what place someone is most likely referring to, depending on where they are.","discoverySummary":"Not sure where to start? Check out some","summary":"some details","classic":"Editor picks","classics":["Portland","Paris","Pluto","Indiana","Davie"],"locate":"Near you","tableIntro":"Every county on the map above gets a score for each place* based on a combination of proximity, population, and Wikipedia article length, then normalized by its share. Think of it like a confidence score; if the #1 ranked place is 5+ percentage points higher than #2, then it is <strong>probably</strong> the most likely place, 2+ is a <strong>maybe</strong>, and anything else is a <strong>toss-up.</strong>","tableIntroNote":"A place could be a town, city, state, country, continent, or planet that is spelled or sounds the same.","placeNote":"<strong># of Counties</strong> is how many times that place is the top ranked place above the <strong>maybe</strong> threshold.","countyNote":"<strong>Share Margin</strong> is the difference between the scores (as percent share) of the top two ranked places.","info":[{"type":"text","value":"Created by <a href=https://pudding.cool/author/russell-samora target=_blank rel=noreferrer>Russell Samora</a>. With editing by <a href=https://pudding.cool/author/michelle-mcghee target=_blank rel=noreferrer>Michelle McGhee</a>."},{"type":"text","value":"Please note that this is a very opinionated take on answering this question. Consider it a conversation starter, not ender. To go deeper on the underlying data and methods, visit our <a href=method target=_blank rel=no_referrer>interactive explainer</a> where you customize and share your own."},{"type":"text","value":"Creating a data set of colloquially recognized place names in the US is a mammoth task since there are tens of thousands of places with varying levels of entity recognition. We are constantly updating the data, so if you spot something wrong with the places being used (or not), <a href=https://docs.google.com/spreadsheets/d/1cHtvcuxvxI6Y2hA5Xa2wg8AW0SZ7ZYG5H5x7H4jGLdk/edit#gid=0 target=_blank rel=noreferrer>help us improve it!</a>"}],"outro":"Get in touch at russell@pudding.cool, and consider supporting The Pudding on <a href=https://www.patreon.com/thepudding target=_blank rel=noreferrer>Patreon!</a>"}