{
  "url": "YOUR_URL_HERE",
  "title": "Social Capital and Economic Mobility in the United States",
  "description": "YOUR_DESCRIPTION",
  "overline": "Code/Story: Diego Valdez Duran",
  "hed": "The Shape of Social Capital in the United States",
  "dek": "YOUR_SUBHEADING",
  "discoverySummary": "YOUR_DISCOVERY_TEXT",
  "summary": "YOUR_SUMMARY",
  "classic": "YOUR_CLASSIC_SECTION_TITLE",
  "classics": [
    "EXAMPLE1",
    "EXAMPLE2",
    "EXAMPLE3",
    "EXAMPLE4",
    "EXAMPLE5"
  ],
  "locate": "YOUR_LOCATE_TEXT",
  "tableIntro": "YOUR_TABLE_INTRO",
  "tableIntroNote": "YOUR_TABLE_NOTE",
  "placeNote": "YOUR_PLACE_NOTE",
  "countyNote": "YOUR_COUNTY_NOTE",
  "overview": [
    {
      "type": "text",
      "value": "Of all the factors that shape economic opportunity in America, social capital is one of the least visible yet most powerful. It’s about who you know, the networks you’re part of, and how those connections can open doors—or close them. And just like income inequality, social capital isn’t evenly distributed. In some counties, cross-class friendships and civic engagement are strong; in others, networks remain fragmented and insular."
    },
    {
        "type": "text",
        "value": "This is what your parents mean when they say that “who you know matters.”"
      },
    {
      "type": "text",
      "value": "But what does social capital look like across the United States? And how does it connect to economic mobility—the ability to climb the social and income ladder? Inspired by researchers at Meta, Harvard, NYU, and Stanford, we explored these questions using data from the Social Capital Atlas. This dataset, which maps social connections among Facebook users aged 25 to 44 living in the United States, gives us the opportunity to uncover insights across counties, ZIP codes, high schools, and colleges."
    },
    {
      "type": "text",
      "value": "Instead of focusing solely on income or education, we wanted to understand how connections—both within and across socioeconomic groups—shape opportunity. Are people from different backgrounds forming meaningful relationships? Or are their networks reinforcing divides? And how do these patterns vary geographically?"
    },
    {
        "type": "text",
        "value": "To begin addressing these questions, we analyzed social capital metrics like economic connectedness, social cohesiveness, and civic engagement alongside measures of economic mobility. Using this data, we created an interactive map to visualize these dynamics across the country, uncovering patterns and disparities in social and economic networks at the macro level."
    },
    {
        "type": "text",
        "value": "First, let’s look at how social capital varies across U.S. counties."
    }
  ],
  "outro": ""
}